backend/tests/back-end-load-testing.yml
# back-end load testing through front-end
config:
  target: "http://127.0.0.1:5173"
  phases: # number of users = duration*arrivalRate
    - duration: 10 # number of seconds
      arrivalRate: 30 # number of users per second
  scenarios:
    - flow:
        - get:
            url: "/getAll"
        - expect:
            json:
              - isArray: true
              - hasSize: 200
        - think: 3 # wait 3 seconds before sending emit
        - loop:
            count: 50
            exec:
              - emit:
                  channel: "newData"
                  message:
                    color: "{{ random('#FFFFFF', '#E4E4E4', '#888888', '#222222', '#FFA7D1') }}"
                    row: "{{ random(0, 199) }}"
                    column: "{{ random(0, 199) }}"
                    timestamp: "50"
                  think: 1
              - set:
                  variableName: "requestData"
                  value: "{{ message }}"
              - listen:
                  channel: "update"
                  expectOtherUsers: false # only listens to events user sent itself, expectation here is if sending user receives update then so do all other connected users
                  expectations:
                    - expect: "data.color"
                      type: "equals"
                      value: "{{ requestData.color }}"
                    - expect: "data.row"
                      type: "equals"
                      value: "{{ requestData.row }}"
                    - expect: "data.column"
                      type: "equals"
                      value: "{{ requestData.column }}"
                    - expect: "data.timestamp"
                      type: "equals"
                      value: "{{ requestData.timestamp }}"